[{"joke":"Yo mama is so fat her blood type is Ragu"},{"joke":"\"Dad, I'm cold.\"\r\n\"Go stand in the corner, I hear it's 90 degrees.\""},{"joke":"Yo mama so fat, that the Twinkies revolve around her."},{"joke":"Your mama is so fat you feed on her junk"},{"joke":"Wife told me to take the spider out instead of killing it... We had some drinks, cool guy, wants to be a web developer."},{"joke":"Yo mama so fat she leaves footsteps in concrete"},{"joke":"Without geometry life is pointless."},{"joke":"I am terrified of elevators. I’m going to start taking steps to avoid them."},{"joke":"Yo mama so fat, when she entered a fat contest, she came in first, second, and third."},{"joke":"182,000 Americans die from Chuck Norris-related accidents every year."},{"joke":"Yo momma is so fat when she fell in love, she broke it."},{"joke":"Why does a chicken coop only have two doors? Because if it had four doors it would be a chicken sedan."},{"joke":"Yo mamma so fat, it takes her two trips to haul ass"},{"joke":"Rules of fighting: 1) Don't bring a knife to a gun fight. 2) Don't bring a gun to a Chuck Norris fight."},{"joke":"Never look a gift Chuck Norris in the mouth, because he will bite your damn eyes off."},{"joke":"Yo mama so fat it aint funny"},{"joke":"I went to the doctor today and he told me I had type A blood but it was a type O."},{"joke":"Yo mama so fat when she wears one of those X jackets, helicopters try to land on her."},{"joke":"Chuck Norris doesn't need to use AJAX because pages are too afraid to postback anyways."},{"joke":"Chuck Norris doesn't need garbage collection because he doesn't call .Dispose(), he calls .DropKick()."},{"joke":"Yo mama so fat she sat on the beach and Greenpeace threw her in."},{"joke":"What do you call a fly without wings? A walk."},{"joke":"Human cloning is outlawed because of Chuck Norris, because then it would be possible for a Chuck Norris roundhouse kick to meet another Chuck Norris roundhouse kick. Physicists theorize that this contact would end the universe."},{"joke":"When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part."},{"joke":"Once death had a near Chuck Norris experience."},{"joke":"Yo momma is so fat when she fell in love, she broke it."},{"joke":"What's the worst part about being a cross-eyed teacher?\r\n\r\nThey can't control their pupils."},{"joke":"Yo mama so fat she sat on the beach and Greenpeace threw her in."},{"joke":"Yo momma so fat not even a Twinkie would get her off the couch, even while a crane tries to help her"},{"joke":"I used to work for a soft drink can crusher. It was soda pressing."},{"joke":"Scotty in Star Trek often says &quot;Ye cannae change the laws of physics.&quot; This is untrue. Chuck Norris can change the laws of physics. With his fists."},{"joke":"Nothing can escape the gravity of a black hole, except for Chuck Norris. Chuck Norris eats black holes. They taste like chicken."},{"joke":"My cat was just sick on the carpet, I don’t think it’s feline well."},{"joke":"The best-laid plans of mice and men often go awry. Even the worst-laid plans of Chuck Norris come off without a hitch."},{"joke":"Chuck Norris can remember the future."}]